# PostGIS

## Import pandas and sqlalchemy

In [1]:
from sqlalchemy import create_engine
import pandas as pd

## Connect to PostGIS

In [2]:
eng = create_engine("postgres://spr18:spr18@localhost/postgisdb")
con = eng.connect()

## Some simple quries

In [4]:
sqlq = '''
        SELECT name FROM nyc_neighborhoods;
'''

pd.read_sql(sql=sqlq,con=con)

                         name
0                 Bensonhurst
1                East Village
2                West Village
3                Throggs Neck
4    Wakefield-Williamsbridge
5                  Auburndale
6                Battery Park
7               Carnegie Hill
8             Mariners Harbor
9                   Rossville
10                     Harlem
11                   Gramercy
12             Queens Village
13             Middle Village
14                Ettingville
15                Morris Park
16                 Baychester
17                Great Kills
18               New Brighton
19                    Fordham
20               Nkew Gardens
21                       Soho
22             Spuyten Duyvil
23                   Woodside
24                  Bay Ridge
25                 Mott Haven
26                   Rosedale
27                Boerum Hill
28                Cobble Hill
29        Morningside Heights
..                        ...
99                  Riverdale
100         Woodlawn-Nordwood
101                  Huguenot
102                   Clifton
103                   Bayside
104              Howard Beach
105                   Tremont
106                    Utopia
107          Garment District
108               East Harlem
109                 Todt Hill
110               Parkchester
111               South Bronx
112     Westerleigh-Castleton
113             College Point
114        Mapleton-Flatlands
115              Little Italy
116        Bedford-Stuyvesant
117          Hamilton Heights
118           Carroll Gardens
119  Astoria-Long Island City
120                 Yorkville
121                 Chinatown
122              Coney Island
123                    Corona
124                  Red Hook
125   Douglastown-Little Neck
126                Whitestone
127                  Steinway
128                  Rosebank

[129 rows x 1 columns]

### what are the names of all the neighborhoods in Brroklyn

In [5]:
sqlq = '''
        SELECT name 
        FROM nyc_neighborhoods
        WHERE boroname = 'Brooklyn';
'''

pd.read_sql(sql=sqlq,con=con)

                        name
0                Bensonhurst
1                  Bay Ridge
2                Boerum Hill
3                Cobble Hill
4                   Downtown
5                Sunset Park
6               Borough Park
7              East Brooklyn
8                   Flatbush
9                 Park Slope
10              Williamsburg
11                  Canarsie
12                 Greenwood
13  Gravesend-Sheepshead Bay
14             Dyker Heights
15               Brownsville
16                  Bushwick
17                Fort Green
18        Mapleton-Flatlands
19        Bedford-Stuyvesant
20           Carroll Gardens
21              Coney Island
22                  Red Hook

### What is the average number of letters and standard deviation of number of letters in the names of all the neighborhoods in NYC, by borough

In [6]:
sqlq = '''
        SELECT boroname, avg(char_length(name)), stddev(char_length(name)) 
        FROM nyc_neighborhoods
        GROUP BY boroname;
'''

pd.read_sql(sql=sqlq,con=con)

        boroname        avg    stddev
0       Brooklyn  11.739130  3.910561
1      Manhattan  11.821429  4.312373
2      The Bronx  12.041667  3.665102
3         Queens  11.666667  5.005744
4  Staten Island  12.291667  5.204339

## Geometries

In [7]:
sqlq = '''
        DROP TABLE IF EXISTS geometries;
        
        CREATE TABLE geometries (name varchar, geom geometry);
        
        INSERT INTO geometries VALUES
            ('Point', 'POINT(0 0)'),
            ('Linestring', 'LINESTRING(0 0, 1 1, 2 1, 2 2)'),
            ('Polygon', 'POLYGON((0 0, 1 0, 1 1, 0 1, 0 0))'),
            ('Polygon', 'POLYGON((0 0, 0 4, 3 4, 3 3, 1 3, 1 1, 3 1, 3 0, 0 0))'),
            ('PolygonWithHole', 'POLYGON((0 0, 10 0, 10 10, 0 10, 0 0),(1 1, 1 2, 2 2, 2 1, 1 1))'),
            ('Collection', 'GEOMETRYCOLLECTION(POINT(2 0),POLYGON((0 0 , 1 0, 1 1, 0 1, 0 0)))');  
'''
con.execute(sqlq)

In [8]:
sqlq = '''
        SELECT name, ST_AsText(geom)
        FROM geometries;
'''

pd.read_sql(sql=sqlq,con=con)

              name                                          st_astext
0            Point                                         POINT(0 0)
1       Linestring                        LINESTRING(0 0,1 1,2 1,2 2)
2          Polygon                     POLYGON((0 0,1 0,1 1,0 1,0 0))
3          Polygon     POLYGON((0 0,0 4,3 4,3 3,1 3,1 1,3 1,3 0,0 0))
4  PolygonWithHole  POLYGON((0 0,10 0,10 10,0 10,0 0),(1 1,1 2,2 2...
5       Collection  GEOMETRYCOLLECTION(POINT(2 0),POLYGON((0 0,1 0...

### get the list of all features defined as an obejct with geometric attributes (from the table geometry_columns provided by PostGIS)

In [9]:
sqlq = '''
        SELECT *
        FROM geometry_columns;
'''

pd.read_sql(sql=sqlq,con=con)

#by querying this table, GIS clients and libraries can determine what to expect when retrieving data and can perform any necessary projection

,f_table_catalog,f_table_schema,f_table_name,f_geometry_column,coord_dimension,srid,type
0,postgisdb,public,nyc_census_blocks,geom,2,26918,MULTIPOLYGON
1,postgisdb,public,nyc_streets,geom,2,26918,MULTILINESTRING
2,postgisdb,public,nyc_neighborhoods,geom,2,26918,MULTIPOLYGON
3,postgisdb,public,nyc_subway_stations,geom,2,26918,POINT
4,postgisdb,public,nyc_homicides,geom,2,26918,POINT
5,postgisdb,public,liberty_island,geom,2,26918,MULTIPOLYGON
6,postgisdb,public,liberty_island_zone,geom,2,26918,POLYGON
7,postgisdb,public,nyc_census_counties,geom,2,26918,MULTIPOLYGON
8,postgisdb,public,geometries,geom,2,0,GEOMETRY

In [10]:
sqlq = '''
        SELECT name, ST_GeometryType(geom), ST_NDims(geom), ST_SRID(geom)
        FROM geometries;
'''

pd.read_sql(sql=sqlq,con=con)

              name        st_geometrytype  st_ndims  st_srid
0            Point               ST_Point         2        0
1       Linestring          ST_LineString         2        0
2          Polygon             ST_Polygon         2        0
3          Polygon             ST_Polygon         2        0
4  PolygonWithHole             ST_Polygon         2        0
5       Collection  ST_GeometryCollection         2        0

### Points

In [11]:
sqlq = '''
        SELECT ST_X(geom), ST_Y(geom)
        FROM geometries
        WHERE name='Point';
'''

pd.read_sql(sql=sqlq,con=con)

   st_x  st_y
0   0.0   0.0

In [12]:
sqlq = '''
        SELECT name, ST_AsText(geom)
        FROM nyc_subway_stations
        LIMIT 1;
'''

pd.read_sql(sql=sqlq,con=con)

           name                                 st_astext
0  Cortlandt St  POINT(583521.854408956 4507077.86259909)

### Linestrings: path between locations

In [13]:
sqlq = '''
        SELECT ST_AsText(geom)
        FROM geometries
        WHERE name = 'Linestring';
'''

pd.read_sql(sql=sqlq,con=con)

                     st_astext
0  LINESTRING(0 0,1 1,2 1,2 2)

In [14]:
sqlq = '''
        SELECT ST_Length(geom), ST_NPoints(geom)
        FROM geometries
        WHERE name = 'Linestring';
'''

pd.read_sql(sql=sqlq,con=con)

   st_length  st_npoints
0   3.414214           4

### Polygons

In [15]:
sqlq = '''
        SELECT name, ST_AsText(geom), ST_Area(geom)
        FROM geometries
        WHERE name = 'Polygon' OR name = 'PolygonWithHole';
'''

pd.read_sql(sql=sqlq,con=con)

              name                                          st_astext  st_area
0          Polygon                     POLYGON((0 0,1 0,1 1,0 1,0 0))      1.0
1          Polygon     POLYGON((0 0,0 4,3 4,3 3,1 3,1 1,3 1,3 0,0 0))      8.0
2  PolygonWithHole  POLYGON((0 0,10 0,10 10,0 10,0 0),(1 1,1 2,2 2...     99.0

### Collections

In [16]:
sqlq = '''
        SELECT name, ST_AsText(geom), ST_NumGeometries(geom)
        FROM geometries
        WHERE name = 'Collection';
'''

pd.read_sql(sql=sqlq,con=con)

,name,st_astext,st_numgeometries
0,Collection,"GEOMETRYCOLLECTION(POINT(2 0),POLYGON((0 0,1 0...",2

## Geometry Input and Output

### WKT (Well-known text)
- input: ST_GeomFromText(text, srid)

In [17]:
sqlq = '''
        SELECT ST_AsText(geom), ST_AsEWKT(geom)
        FROM geometries
        WHERE name = 'Polygon';
'''

pd.read_sql(sql=sqlq,con=con)

,st_astext,st_asewkt
0,"POLYGON((0 0,1 0,1 1,0 1,0 0))","POLYGON((0 0,1 0,1 1,0 1,0 0))"
1,"POLYGON((0 0,0 4,3 4,3 3,1 3,1 1,3 1,3 0,0 0))","POLYGON((0 0,0 4,3 4,3 3,1 3,1 1,3 1,3 0,0 0))"

### WKB (Well-known binary)
- input: ST_GeomFromWKB(bytea)

In [18]:
sqlq = '''
        SELECT ST_AsBinary(geom), ST_AsEWKB(geom)
        FROM geometries
        WHERE name = 'Polygon';
'''

pd.read_sql(sql=sqlq,con=con)

,st_asbinary,st_asewkb
0,"[, ,  ,  ,  , ,  ,  ,  , ,  ,  ,  ,  ,  , ...","[, ,  ,  ,  , ,  ,  ,  , ,  ,  ,  ,  ,  , ..."
1,"[, ,  ,  ,  , ,  ,  ,  , \t,  ,  ,  ,  ,  ,...","[, ,  ,  ,  , ,  ,  ,  , \t,  ,  ,  ,  ,  ,..."

### GML (Geographic Mark-up Language)
- input: ST_GeomFromGML(text)

In [19]:
sqlq = '''
        SELECT ST_AsGML(geom)
        FROM geometries
        WHERE name = 'Polygon';
'''

pd.read_sql(sql=sqlq,con=con)

                                            st_asgml
0  <gml:Polygon><gml:outerBoundaryIs><gml:LinearR...
1  <gml:Polygon><gml:outerBoundaryIs><gml:LinearR...

### KML (Keyhole Mark-up Language)
- input: ST_GeomFromKML(text)

In [20]:
sqlq = '''
        SELECT ST_AsKML(geom)
        FROM nyc_subway_stations
        LIMIT 1;
'''

pd.read_sql(sql=sqlq,con=con)

                                            st_askml
0  <Point><coordinates>-74.011215462040639,40.710...

### GeoJSON
- input: ST_GeomFromGeoJSON(text)

In [21]:
sqlq = '''
        SELECT ST_AsGeoJSON(geom)
        FROM nyc_subway_stations
        LIMIT 1;
'''

pd.read_sql(sql=sqlq,con=con)

                                        st_asgeojson
0  {"type":"Point","coordinates":[583521.85440895...

### SVG (Scalable Vector Graphics)

In [22]:
sqlq = '''
        SELECT ST_AsSVG(geom)
        FROM nyc_subway_stations
        LIMIT 1;
'''

pd.read_sql(sql=sqlq,con=con)

                                            st_assvg
0  cx="583521.854408956016414" cy="-4507077.86259...

## Spatial Relationships

### ST_Equals: tests the spaital equality of two geometries

In [23]:
sqlq = '''
        SELECT name, geom, ST_AsText(geom)
        FROM nyc_subway_stations
        WHERE name = 'Broad St';
'''

pd.read_sql(sql=sqlq,con=con)

,name,geom,st_astext
0,Broad St,0101000020266900000EEBD4CF27CF2141BC17D6951631...,POINT(583571.905921312 4506714.34119218)

In [24]:
pd.read_sql(sql=sqlq,con=con)['geom'][0]

'0101000020266900000EEBD4CF27CF2141BC17D69516315141'

In [25]:
sqlq = '''
        SELECT name
        FROM nyc_subway_stations
        WHERE ST_Equals(geom,'0101000020266900000EEBD4CF27CF2141BC17D69516315141');
'''

pd.read_sql(sql=sqlq,con=con)

       name
0  Broad St

### ST_Intersects, ST_Disjoint, ST_Crosses and ST_Overlaps
-  intersects: two shapes have any space in common
-  disjoint: two shapes do not intersect
-  cross: for multipoint/polygon, multipoint/linestring, linestring/linestring, linestring/polygon, and linestring/multipolygon comparisons, if the intersection results in a geometry whose dimension is one less than the maximum dimension of the two source geometries and the interscetion set is interior to both source geometries
-  overlap:  compares two geometries of the same dimension and returns TRUE if their intersection set results in a geometry different from both but of the same dimension

In [26]:
sqlq = '''
        SELECT name, ST_AsText(geom)
        FROM nyc_subway_stations
        WHERE name = 'Broad St';
'''

pd.read_sql(sql=sqlq,con=con)

       name                                 st_astext
0  Broad St  POINT(583571.905921312 4506714.34119218)

#### Determine the neighborhood of Broad Street subway station suing the ST_Intersects function

In [27]:
sqlq = '''
        SELECT name, boroname
        FROM nyc_neighborhoods
        WHERE ST_Intersects(geom, ST_GeomFromText('POINT(583571 4506714)',26918));
'''

pd.read_sql(sql=sqlq,con=con)

                 name   boroname
0  Financial District  Manhattan

## Other Useful Functions
- ST_Touches(geomA, geomB): tests whether two geometries touch at their boundaries, but do not intersect in their interiors
- ST_Within(geomA, geomB): test whether the first geometry is completely within the second geometry
- ST_Contains(geomA, geomB): test whether the second geometry is completely contained by the first geometry
- ST_Distance(geomA, geomB): calculates the shortest distance between two geometries and returns it as a float
- ST_DWithin(geomA, geomB, dist): tests whether two geometries are within a distance of one another

In [28]:
sqlq = '''
        SELECT ST_Distance(
        ST_GeometryFromText('POINT(0 5)'), 
        ST_GeometryFromText('LINESTRING(-2 2, 2 2)')
        );
'''

pd.read_sql(sql=sqlq,con=con)

   st_distance
0          3.0

In [29]:
sqlq = '''
        SELECT name
        FROM nyc_streets
        WHERE ST_DWithin(
            geom,
            ST_GeomFromText('POINT(583571 4506714)',26918),
            10
        );
'''

pd.read_sql(sql=sqlq,con=con)

        name
0    Wall St
1   Broad St
2  Nassau St

## Spatial Joins

In [30]:
sqlq = '''
        SELECT
            subways.name AS subway_name,
            neighborhoods.name AS neighborhood_name,
            neighborhoods.boroname AS borough
        FROM nyc_neighborhoods AS neighborhoods
        JOIN nyc_subway_stations AS subways
        ON ST_Contains(neighborhoods.geom, subways.geom)
        WHERE subways.name = 'Broad St'
        ;
'''

pd.read_sql(sql=sqlq,con=con)

  subway_name   neighborhood_name    borough
0    Broad St  Financial District  Manhattan

### Join and Summarize
-  what is the population and racial make-up of the neighborhoods of Manhattan?

In [31]:
sqlq = '''
        SELECT
            neighborhoods.name AS neighborhood_name,
            SUM(census.popn_total) AS population,
            100.0 * SUM(census.popn_white) / SUM(census.popn_total) AS white_pct,
            100.0 * SUM(census.popn_black) / SUM(census.popn_total) AS black_pct
        FROM nyc_neighborhoods AS neighborhoods
        JOIN nyc_census_blocks AS census
        ON ST_Intersects(neighborhoods.geom, census.geom)
        WHERE neighborhoods.boroname = 'Manhattan'
        GROUP BY neighborhoods.name
        ORDER BY white_pct DESC
        ;
'''

pd.read_sql(sql=sqlq,con=con)

      neighborhood_name  population  white_pct  black_pct
0         Carnegie Hill     18763.0  90.081543   1.412354
1          West Village     26718.0  87.596377   2.174564
2     North Sutton Area     22460.0  87.564559   1.553874
3       Upper East Side    203741.0  85.022160   2.722083
4                  Soho     15436.0  84.646281   2.235035
5     Greenwich Village     57224.0  81.976094   2.437788
6          Central Park     46600.0  79.493562   7.967811
7               Tribeca     20908.0  79.118041   3.548881
8              Gramercy    104876.0  75.458637   4.720813
9           Murray Hill     29655.0  75.012645   2.512224
10              Chelsea     61340.0  74.815781   6.372677
11      Upper West Side    214761.0  74.561489   9.188354
12              Midtown     76840.0  72.601510   5.166580
13         Battery Park     17153.0  71.830001   3.375503
14   Financial District     34807.0  69.928463   3.829689
15              Clinton     32201.0  65.274370   7.943853
16         East Village     82266.0  63.265505   8.771546
17     Garment District     10539.0  55.185501   7.087959
18  Morningside Heights     42844.0  52.719167  19.370274
19         Little Italy     12568.0  49.029281   1.822088
20            Yorkville     58450.0  35.555175  29.722840
21               Inwood     50047.0  35.214898  16.846165
22   Washington Heights    169013.0  34.873057  16.827108
23      Lower East Side     96156.0  33.509089   9.075877
24          East Harlem     60576.0  26.436212  40.383980
25     Hamilton Heights     67432.0  23.889251  35.772334
26            Chinatown     16209.0  15.164415   3.757172
27               Harlem    134955.0  15.094661  67.061613

## Spatial Indexing
- without indexing, any search for a feature requires a "sequential scan" of every record in the database, which is slow for large datasets. Indexing speeds up searching by organizing the data into a search tree which can be quickly traversed to find a particular record
-  when we load the nyc_census_blocks table, PostGIS automatically creates a spatial index called nyc_census_blocks_geom_idx

In [32]:
sqlq = '''
        DROP INDEX nyc_census_blocks_geom_idx;
'''
con.execute(sqlq)

In [33]:
sqlq = '''
        SELECT blocks.blkid
        FROM nyc_census_blocks blocks
        JOIN nyc_subway_stations subways
        ON ST_Contains(blocks.geom, subways.geom)
        WHERE subways.name = 'Broad St'            
        ;
'''

pd.read_sql(sql=sqlq,con=con)

             blkid
0  360610007001009

In [34]:
sqlq = '''
        CREATE INDEX nyc_census_blocks_geom_idx
        ON nyc_census_blocks
        USING GIST(geom);
'''
con.execute(sqlq)

## Projecting Data

In [35]:
sqlq = '''
        SELECT ST_SRID(geom)
        FROM nyc_streets
        LIMIT 1            
        ;
'''

pd.read_sql(sql=sqlq,con=con)

   st_srid
0    26918

In [36]:
sqlq = '''
        SELECT *
        FROM spatial_ref_sys
        WHERE srid = 26918            
        ;
'''

pd.read_sql(sql=sqlq,con=con)

,srid,auth_name,auth_srid,srtext,proj4text
0,26918,EPSG,26918,"PROJCS[""NAD83 / UTM zone 18N"",GEOGCS[""NAD83"",D...",+proj=utm +zone=18 +datum=NAD83 +units=m +no_d...

In [37]:
sqlq = '''
        SELECT ST_Equals(
            ST_GeomFromText('POINT(0 0)',4326),
            ST_GeomFromText('POINT(0 0)', 26918)
        )        
        ;
'''

pd.read_sql(sql=sqlq,con=con)

InternalError: (psycopg2.InternalError) Operation on mixed SRID geometries
CONTEXT:  SQL function "st_equals" statement 1
 [SQL: "\n        SELECT ST_Equals(\n            ST_GeomFromText('POINT(0 0)',4326),\n            ST_GeomFromText('POINT(0 0)', 26918)\n        )        \n        ;\n"] (Background on this error at: http://sqlalche.me/e/2j85)

### convert the coordinates to long/lat

In [38]:
sqlq = '''
        SELECT ST_AsText(ST_Transform(geom,4326))
        FROM nyc_subway_stations
        WHERE name = 'Broad St'            
        ;
'''

pd.read_sql(sql=sqlq,con=con)

                                   st_astext
0  POINT(-74.0106714688735 40.7071048155841)

## Geometry constructing functions

### ST_Centroid, ST_PointOnSurface

In [39]:
sqlq = '''
        SELECT ST_AsText(ST_Centroid(geom)), ST_AsText(ST_PointOnSurface(geom))
        FROM geometries
        WHERE name = 'Polygon'            
        ;
'''

pd.read_sql(sql=sqlq,con=con)

        st_astext       st_astext
0  POINT(0.5 0.5)  POINT(0.5 0.5)
1   POINT(1.25 2)    POINT(0.5 2)

### ST_Buffer
- takes in a buffer distance and geometry type  and outputs a polygon with a boundary the buffer distance away from the input geometry

In [40]:
sqlq = '''
        DROP TABLE IF EXISTS liberty_island;
        
        CREATE TABLE liberty_island AS
        SELECT *
        FROM nyc_census_blocks
        WHERE blkid = '360610001001001'
        ;
'''
con.execute(sqlq)

In [41]:
sqlq = '''
        DROP TABLE IF EXISTS liberty_island_zone;
        
        CREATE TABLE liberty_island_zone AS
        SELECT ST_Buffer(geom,500)::geometry(Polygon,26918) AS geom
        FROM nyc_census_blocks
        WHERE blkid = '360610001001001'
        ;
'''
con.execute(sqlq)

# plot the results in QGIS

### ST_Intersection
-  overlay, or creates a new coverage by calculating the intersection of two superimposed polygons

In [42]:
sqlq = '''
        SELECT ST_AsText(ST_Intersection(
        ST_Buffer('POINT(0 0)', 2),
        ST_Buffer('POINT(3 0)', 2)
        ))
        ;
'''

pd.read_sql(sql=sqlq,con=con)

                                           st_astext
0  POLYGON((2 0,1.96157056080646 -0.3901806440322...

### ST_Union
- takes inputs and removes common lines

In [43]:
sqlq = '''
        SELECT ST_AsText(ST_Intersection(
        ST_Buffer('POINT(0 0)', 2),
        ST_Buffer('POINT(3 0)', 2)
        ))
        ;
'''

pd.read_sql(sql=sqlq,con=con)

                                           st_astext
0  POLYGON((2 0,1.96157056080646 -0.3901806440322...

#### create a county map by merging all geometries that share the same first 5 digits of their blkid

In [44]:
sqlq = '''
        DROP TABLE IF EXISTS nyc_census_counties;
        
        CREATE TABLE nyc_census_counties AS
        SELECT
            ST_Union(geom)::Geometry(MultiPolygon,26918) AS geom,
            SubStr(blkid,1,5) AS countyid
        FROM nyc_census_blocks
        GROUP BY countyid
        ;
'''
con.execute(sqlq)

## Nearest-Neighbour Searching
- what is the nearest candidate feature to query feature?

### closest 10 streets to Broad Street Station
- the index is built using the bounding boxes of geometries, the distance between any geometries that are not points will be inexact: they will be the distances between the bounding boxes of geometries
- <-> means "distance between box centers"
- <#> means "distance between box edges"

In [45]:
sqlq = '''
        SELECT 
            streets.gid, 
            streets.name,
            ST_Distance(
                streets.geom,
                (SELECT geom FROM nyc_subway_stations WHERE name = 'Broad St')
            ) as distance
        FROM nyc_streets streets
        ORDER BY
            streets.geom <->
            (SELECT geom FROM nyc_subway_stations WHERE name = 'Broad St')
        LIMIT 10
        ;
'''

pd.read_sql(sql=sqlq,con=con)

     gid         name    distance
0  17385      Wall St    0.714202
1  17390     Broad St    0.872023
2  17436    Nassau St    1.299287
3  17350       New St   63.949917
4  17402      Pine St   75.846104
5  17360  Exchange Pl  101.624184
6  17315     Broadway  112.049824
7  17289    Rector St  114.442001
8  17469   William St  126.934065
9  17347     Cedar St  133.009278